app/views/file_lists/_search.html.erb

SELECT `disks`.`disk` FROM `disks`  GROUP BY disk  ORDER BY `disks`.`disk` ASC
---
	<div class="small-4 columns">
		<%= select_tag(:disk, options_for_select([@disk] + ["All"] + Disk.select(:disk).group(:disk).order(:disk).map {|d|[d.disk]})) %>