app/controllers/file_lists_controller.rb

  def index
    @disk = params[:disk]
    if (@disk == "")
      @disk = "All"
    end
    @filename = params[:filename]
    filename = @filename.to_s.gsub(/ANY/, "%")
    @page_number = 0
    if (params[:page_number].present?)
      @page_number = params[:page_number].to_i
    end
    @records_per_page = 25
    if (params[:records_per_page].present?)
      @records_per_page = params[:records_per_page].to_i
    end
    if (params[:disk].present?)
      if (@disk == "All")
        if (params[:filename].start_with?('^'))
          @file_lists = FileList.starts_with_all_disks(filename.gsub(/^./, "")).offset(@page_number * @records_per_page).limit(@records_per_page)
---
SELECT `disks`.`disk` FROM `disks`  GROUP BY disk  ORDER BY `disks`.`disk` ASC
SELECT  `file_lists`.* FROM `file_lists`  WHERE (disk = 'A' and filename like '%%') LIMIT 25 OFFSET 0